{"config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 34], "sparse": false, "name": "input_2", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, 2048], "sparse": false, "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"trainable": true, "mask_zero": true, "embeddings_regularizer": null, "input_length": null, "activity_regularizer": null, "embeddings_constraint": null, "output_dim": 200, "batch_input_shape": [null, null], "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "dtype": "float32", "input_dim": 1652, "name": "embedding_1"}, "class_name": "Embedding", "name": "embedding_1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"rate": 0.5, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"rate": 0.5, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 256, "name": "dense_1"}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"use_bias": true, "bias_regularizer": null, "trainable": true, "unroll": false, "units": 256, "return_state": false, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "bias_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "go_backwards": false, "kernel_regularizer": null, "activation": "tanh", "name": "lstm_1", "recurrent_regularizer": null, "stateful": false, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "implementation": 1}, "class_name": "LSTM", "name": "lstm_1", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_1"}, "class_name": "Add", "name": "add_1", "inbound_nodes": [[["dense_1", 0, 0, {}], ["lstm_1", 0, 0, {}]]]}, {"config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 256, "name": "dense_2"}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 1652, "name": "dense_3"}, "class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["dense_3", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}